MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KM102/mcu.h
/* CCP1STAT */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* CCP2CON1L */
/* Bitname _MOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TMRSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSLP cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _CCPON cannot be defined because it is used by more than one SFR */
/* Bitname _MOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMR32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD3 cannot be defined because it is used by more than one SFR */

/* CCP2CON1H */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ALTSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ONESHOT cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPS cannot be defined because it is used by more than one SFR */
/* Bitname _RTRGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPSSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC4 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _OPSRC cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS3 cannot be defined because it is used by more than one SFR */

/* CCP2CON2L */
/* Bitname _ASDG cannot be defined because it is used by more than one SFR */
/* Bitname _SSDG cannot be defined because it is used by more than one SFR */
/* Bitname _ASDGM cannot be defined because it is used by more than one SFR */
/* Bitname _PWMRSEN cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG0 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG1 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG2 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG3 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG4 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG5 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG6 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG7 cannot be defined because it is used by more than one SFR */

/* CCP2CON2H */
/* Bitname _ICS cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM cannot be defined because it is used by more than one SFR */
/* Bitname _OCAEN cannot be defined because it is used by more than one SFR */
/* Bitname _OENSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ICS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL2 cannot be defined because it is used by more than one SFR */

/* CCP2CON3H */
/* Bitname _PSSACE cannot be defined because it is used by more than one SFR */
/* Bitname _POLACE cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT cannot be defined because it is used by more than one SFR */
/* Bitname _OETRIG cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT2 cannot be defined because it is used by more than one SFR */

/* CCP2STAT */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* CCP2STATL */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* SPI1BUF */
#define _SSPBUF SPI1BUFbits.SSPBUF
#define _SPI1BUF SPI1BUFbits.SPI1BUF

/* SSP1CON1 */
#define _SSPM SSP1CON1bits.SSPM
#define _CKP SSP1CON1bits.CKP
#define _SSPEN SSP1CON1bits.SSPEN
#define _SSPOV SSP1CON1bits.SSPOV
#define _WCOL SSP1CON1bits.WCOL
#define _SSPM0 SSP1CON1bits.SSPM0
#define _SSPM1 SSP1CON1bits.SSPM1
#define _SSPM2 SSP1CON1bits.SSPM2
#define _SSPM3 SSP1CON1bits.SSPM3

/* SSP1CON2 */
#define _SEN SSP1CON2bits.SEN
#define _RSEN SSP1CON2bits.RSEN
#define _PEN SSP1CON2bits.PEN
#define _RCEN SSP1CON2bits.RCEN
#define _ACKEN SSP1CON2bits.ACKEN
#define _ACKDT SSP1CON2bits.ACKDT
#define _ACKSTAT SSP1CON2bits.ACKSTAT
#define _GCEN SSP1CON2bits.GCEN
#define _ADMSK SSP1CON2bits.ADMSK
#define _ADMSK1 SSP1CON2bits.ADMSK1
#define _ADMSK2 SSP1CON2bits.ADMSK2
#define _ADMSK3 SSP1CON2bits.ADMSK3
#define _ADMSK4 SSP1CON2bits.ADMSK4
#define _ADMSK5 SSP1CON2bits.ADMSK5

/* SSP1CON3 */
#define _DHEN SSP1CON3bits.DHEN
#define _AHEN SSP1CON3bits.AHEN
#define _SBCDE SSP1CON3bits.SBCDE
#define _SDAHT SSP1CON3bits.SDAHT
#define _BOEN SSP1CON3bits.BOEN
#define _SCIE SSP1CON3bits.SCIE
#define _PCIE SSP1CON3bits.PCIE
#define _ACKTIM SSP1CON3bits.ACKTIM

/* SSP1STAT */
#define _BF SSP1STATbits.BF
#define _UA SSP1STATbits.UA
#define _R_NOT_W SSP1STATbits.R_NOT_W
#define _S SSP1STATbits.S
#define _P SSP1STATbits.P
#define _D_NOT_A SSP1STATbits.D_NOT_A
#define _CKE SSP1STATbits.CKE
#define _SMP SSP1STATbits.SMP
#define _R_W SSP1STATbits.R_W
#define _D_A SSP1STATbits.D_A
#define _NOT_W SSP1STATbits.NOT_W
#define _NOT_A SSP1STATbits.NOT_A
#define _NOT_WRITE SSP1STATbits.NOT_WRITE
#define _NOT_ADDRESS SSP1STATbits.NOT_ADDRESS
#define _READ_WRITE SSP1STATbits.READ_WRITE
#define _DATA_ADDRESS SSP1STATbits.DATA_ADDRESS
#define _I2C_READ SSP1STATbits.I2C_READ
#define _I2C_START SSP1STATbits.I2C_START
#define _I2C_STOP SSP1STATbits.I2C_STOP
#define _I2C_DAT SSP1STATbits.I2C_DAT

/* I2C1ADD */
#define _SSPADD I2C1ADDbits.SSPADD
#define _I2CADD I2C1ADDbits.I2CADD

/* I2C1MSK */
#define _MSK0 I2C1MSKbits.MSK0
#define _MSK1 I2C1MSKbits.MSK1
#define _MSK2 I2C1MSKbits.MSK2
#define _MSK3 I2C1MSKbits.MSK3
#define _MSK4 I2C1MSKbits.MSK4
#define _MSK5 I2C1MSKbits.MSK5
#define _MSK6 I2C1MSKbits.MSK6
#define _MSK7 I2C1MSKbits.MSK7
#define _AMSK I2C1MSKbits.AMSK

